Microchip-MPLAB-Harmony/wireless_apps_pic32cxbz3_wbz35/apps/zigbee/csc_sleep_touch/firmware/src/packs/WBZ351_DFP/component/gpio.h
#define GPIO_TRIS_TRIS_Pos                    _UINT32_(0)                                          /* (GPIO_TRIS Position)  */
#define GPIO_TRIS_TRIS_Msk                    (_UINT32_(0x7FFF) << GPIO_TRIS_TRIS_Pos)             /* (GPIO_TRIS Mask) TRIS */
#define GPIO_TRIS_TRIS(value)                 (GPIO_TRIS_TRIS_Msk & (_UINT32_(value) << GPIO_TRIS_TRIS_Pos)) 

/* -------- GPIO_TRISCLR : (GPIO Offset: 0x14) (R/W 32)  -------- */
#define GPIO_TRISCLR_RESETVALUE               _UINT32_(0x00)                                       /*  (GPIO_TRISCLR)   Reset Value */

#define GPIO_TRISCLR_Msk                      _UINT32_(0x00000000)                                 /* (GPIO_TRISCLR) Register Mask  */


/* -------- GPIO_TRISSET : (GPIO Offset: 0x18) (R/W 32)  -------- */
#define GPIO_TRISSET_RESETVALUE               _UINT32_(0x00)                                       /*  (GPIO_TRISSET)   Reset Value */

#define GPIO_TRISSET_Msk                      _UINT32_(0x00000000)                                 /* (GPIO_TRISSET) Register Mask  */


/* -------- GPIO_TRISINV : (GPIO Offset: 0x1C) (R/W 32)  -------- */
#define GPIO_TRISINV_RESETVALUE               _UINT32_(0x00)                                       /*  (GPIO_TRISINV)   Reset Value */

#define GPIO_TRISINV_Msk                      _UINT32_(0x00000000)                                 /* (GPIO_TRISINV) Register Mask  */


/* -------- GPIO_PORT : (GPIO Offset: 0x20) (R/W 32)  -------- */
#define GPIO_PORT_RESETVALUE                  _UINT32_(0x00)                                       /*  (GPIO_PORT)   Reset Value */

#define GPIO_PORT_R0_Pos                      _UINT32_(0)                                          /* (GPIO_PORT)  Position */
#define GPIO_PORT_R0_Msk                      (_UINT32_(0x1) << GPIO_PORT_R0_Pos)                  /* (GPIO_PORT)  Mask */
#define GPIO_PORT_R0(value)                   (GPIO_PORT_R0_Msk & (_UINT32_(value) << GPIO_PORT_R0_Pos)) /* Assigment of value for R0 in the GPIO_PORT register */
#define GPIO_PORT_R1_Pos                      _UINT32_(1)                                          /* (GPIO_PORT)  Position */
#define GPIO_PORT_R1_Msk                      (_UINT32_(0x1) << GPIO_PORT_R1_Pos)                  /* (GPIO_PORT)  Mask */
#define GPIO_PORT_R1(value)                   (GPIO_PORT_R1_Msk & (_UINT32_(value) << GPIO_PORT_R1_Pos)) /* Assigment of value for R1 in the GPIO_PORT register */
#define GPIO_PORT_R2_Pos                      _UINT32_(2)                                          /* (GPIO_PORT)  Position */
#define GPIO_PORT_R2_Msk                      (_UINT32_(0x1) << GPIO_PORT_R2_Pos)                  /* (GPIO_PORT)  Mask */
#define GPIO_PORT_R2(value)                   (GPIO_PORT_R2_Msk & (_UINT32_(value) << GPIO_PORT_R2_Pos)) /* Assigment of value for R2 in the GPIO_PORT register */
#define GPIO_PORT_R3_Pos                      _UINT32_(3)                                          /* (GPIO_PORT)  Position */
#define GPIO_PORT_R3_Msk                      (_UINT32_(0x1) << GPIO_PORT_R3_Pos)                  /* (GPIO_PORT)  Mask */
#define GPIO_PORT_R3(value)                   (GPIO_PORT_R3_Msk & (_UINT32_(value) << GPIO_PORT_R3_Pos)) /* Assigment of value for R3 in the GPIO_PORT register */
#define GPIO_PORT_R4_Pos                      _UINT32_(4)                                          /* (GPIO_PORT)  Position */
#define GPIO_PORT_R4_Msk                      (_UINT32_(0x1) << GPIO_PORT_R4_Pos)                  /* (GPIO_PORT)  Mask */
#define GPIO_PORT_R4(value)                   (GPIO_PORT_R4_Msk & (_UINT32_(value) << GPIO_PORT_R4_Pos)) /* Assigment of value for R4 in the GPIO_PORT register */
#define GPIO_PORT_R5_Pos                      _UINT32_(5)                                          /* (GPIO_PORT)  Position */
#define GPIO_PORT_R5_Msk                      (_UINT32_(0x1) << GPIO_PORT_R5_Pos)                  /* (GPIO_PORT)  Mask */
#define GPIO_PORT_R5(value)                   (GPIO_PORT_R5_Msk & (_UINT32_(value) << GPIO_PORT_R5_Pos)) /* Assigment of value for R5 in the GPIO_PORT register */
#define GPIO_PORT_R6_Pos                      _UINT32_(6)                                          /* (GPIO_PORT)  Position */
#define GPIO_PORT_R6_Msk                      (_UINT32_(0x1) << GPIO_PORT_R6_Pos)                  /* (GPIO_PORT)  Mask */
#define GPIO_PORT_R6(value)                   (GPIO_PORT_R6_Msk & (_UINT32_(value) << GPIO_PORT_R6_Pos)) /* Assigment of value for R6 in the GPIO_PORT register */
#define GPIO_PORT_R7_Pos                      _UINT32_(7)                                          /* (GPIO_PORT)  Position */
#define GPIO_PORT_R7_Msk                      (_UINT32_(0x1) << GPIO_PORT_R7_Pos)                  /* (GPIO_PORT)  Mask */
#define GPIO_PORT_R7(value)                   (GPIO_PORT_R7_Msk & (_UINT32_(value) << GPIO_PORT_R7_Pos)) /* Assigment of value for R7 in the GPIO_PORT register */
#define GPIO_PORT_R8_Pos                      _UINT32_(8)                                          /* (GPIO_PORT)  Position */
#define GPIO_PORT_R8_Msk                      (_UINT32_(0x1) << GPIO_PORT_R8_Pos)                  /* (GPIO_PORT)  Mask */
#define GPIO_PORT_R8(value)                   (GPIO_PORT_R8_Msk & (_UINT32_(value) << GPIO_PORT_R8_Pos)) /* Assigment of value for R8 in the GPIO_PORT register */
#define GPIO_PORT_R9_Pos                      _UINT32_(9)                                          /* (GPIO_PORT)  Position */
#define GPIO_PORT_R9_Msk                      (_UINT32_(0x1) << GPIO_PORT_R9_Pos)                  /* (GPIO_PORT)  Mask */
#define GPIO_PORT_R9(value)                   (GPIO_PORT_R9_Msk & (_UINT32_(value) << GPIO_PORT_R9_Pos)) /* Assigment of value for R9 in the GPIO_PORT register */
#define GPIO_PORT_R10_Pos                     _UINT32_(10)                                         /* (GPIO_PORT)  Position */
#define GPIO_PORT_R10_Msk                     (_UINT32_(0x1) << GPIO_PORT_R10_Pos)                 /* (GPIO_PORT)  Mask */
#define GPIO_PORT_R10(value)                  (GPIO_PORT_R10_Msk & (_UINT32_(value) << GPIO_PORT_R10_Pos)) /* Assigment of value for R10 in the GPIO_PORT register */
#define GPIO_PORT_R11_Pos                     _UINT32_(11)                                         /* (GPIO_PORT)  Position */
#define GPIO_PORT_R11_Msk                     (_UINT32_(0x1) << GPIO_PORT_R11_Pos)                 /* (GPIO_PORT)  Mask */
#define GPIO_PORT_R11(value)                  (GPIO_PORT_R11_Msk & (_UINT32_(value) << GPIO_PORT_R11_Pos)) /* Assigment of value for R11 in the GPIO_PORT register */
#define GPIO_PORT_R12_Pos                     _UINT32_(12)                                         /* (GPIO_PORT)  Position */
#define GPIO_PORT_R12_Msk                     (_UINT32_(0x1) << GPIO_PORT_R12_Pos)                 /* (GPIO_PORT)  Mask */
#define GPIO_PORT_R12(value)                  (GPIO_PORT_R12_Msk & (_UINT32_(value) << GPIO_PORT_R12_Pos)) /* Assigment of value for R12 in the GPIO_PORT register */
#define GPIO_PORT_R13_Pos                     _UINT32_(13)                                         /* (GPIO_PORT)  Position */
#define GPIO_PORT_R13_Msk                     (_UINT32_(0x1) << GPIO_PORT_R13_Pos)                 /* (GPIO_PORT)  Mask */
#define GPIO_PORT_R13(value)                  (GPIO_PORT_R13_Msk & (_UINT32_(value) << GPIO_PORT_R13_Pos)) /* Assigment of value for R13 in the GPIO_PORT register */
#define GPIO_PORT_R14_Pos                     _UINT32_(14)                                         /* (GPIO_PORT)  Position */
#define GPIO_PORT_R14_Msk                     (_UINT32_(0x1) << GPIO_PORT_R14_Pos)                 /* (GPIO_PORT)  Mask */
#define GPIO_PORT_R14(value)                  (GPIO_PORT_R14_Msk & (_UINT32_(value) << GPIO_PORT_R14_Pos)) /* Assigment of value for R14 in the GPIO_PORT register */
#define GPIO_PORT_Msk                         _UINT32_(0x00007FFF)                                 /* (GPIO_PORT) Register Mask  */

