Microchip-MPLAB-Harmony/wireless_apps_pic32cxbz3_wbz35/apps/zigbee/csc_sleep_touch/firmware/src/packs/WBZ351_DFP/component/gpio.h
#define GPIO_PORT_R_Pos                       _UINT32_(0)                                          /* (GPIO_PORT Position)  */
#define GPIO_PORT_R_Msk                       (_UINT32_(0x7FFF) << GPIO_PORT_R_Pos)                /* (GPIO_PORT Mask) R */
#define GPIO_PORT_R(value)                    (GPIO_PORT_R_Msk & (_UINT32_(value) << GPIO_PORT_R_Pos)) 

/* -------- GPIO_PORTCLR : (GPIO Offset: 0x24) (R/W 32)  -------- */
#define GPIO_PORTCLR_RESETVALUE               _UINT32_(0x00)                                       /*  (GPIO_PORTCLR)   Reset Value */

#define GPIO_PORTCLR_Msk                      _UINT32_(0x00000000)                                 /* (GPIO_PORTCLR) Register Mask  */


/* -------- GPIO_PORTSET : (GPIO Offset: 0x28) (R/W 32)  -------- */
#define GPIO_PORTSET_RESETVALUE               _UINT32_(0x00)                                       /*  (GPIO_PORTSET)   Reset Value */

#define GPIO_PORTSET_Msk                      _UINT32_(0x00000000)                                 /* (GPIO_PORTSET) Register Mask  */


/* -------- GPIO_PORTINV : (GPIO Offset: 0x2C) (R/W 32)  -------- */
#define GPIO_PORTINV_RESETVALUE               _UINT32_(0x00)                                       /*  (GPIO_PORTINV)   Reset Value */

#define GPIO_PORTINV_Msk                      _UINT32_(0x00000000)                                 /* (GPIO_PORTINV) Register Mask  */


/* -------- GPIO_LAT : (GPIO Offset: 0x30) (R/W 32)  -------- */
#define GPIO_LAT_RESETVALUE                   _UINT32_(0x00)                                       /*  (GPIO_LAT)   Reset Value */

#define GPIO_LAT_LAT0_Pos                     _UINT32_(0)                                          /* (GPIO_LAT)  Position */
#define GPIO_LAT_LAT0_Msk                     (_UINT32_(0x1) << GPIO_LAT_LAT0_Pos)                 /* (GPIO_LAT)  Mask */
#define GPIO_LAT_LAT0(value)                  (GPIO_LAT_LAT0_Msk & (_UINT32_(value) << GPIO_LAT_LAT0_Pos)) /* Assigment of value for LAT0 in the GPIO_LAT register */
#define GPIO_LAT_LAT1_Pos                     _UINT32_(1)                                          /* (GPIO_LAT)  Position */
#define GPIO_LAT_LAT1_Msk                     (_UINT32_(0x1) << GPIO_LAT_LAT1_Pos)                 /* (GPIO_LAT)  Mask */
#define GPIO_LAT_LAT1(value)                  (GPIO_LAT_LAT1_Msk & (_UINT32_(value) << GPIO_LAT_LAT1_Pos)) /* Assigment of value for LAT1 in the GPIO_LAT register */
#define GPIO_LAT_LAT2_Pos                     _UINT32_(2)                                          /* (GPIO_LAT)  Position */
#define GPIO_LAT_LAT2_Msk                     (_UINT32_(0x1) << GPIO_LAT_LAT2_Pos)                 /* (GPIO_LAT)  Mask */
#define GPIO_LAT_LAT2(value)                  (GPIO_LAT_LAT2_Msk & (_UINT32_(value) << GPIO_LAT_LAT2_Pos)) /* Assigment of value for LAT2 in the GPIO_LAT register */
#define GPIO_LAT_LAT3_Pos                     _UINT32_(3)                                          /* (GPIO_LAT)  Position */
#define GPIO_LAT_LAT3_Msk                     (_UINT32_(0x1) << GPIO_LAT_LAT3_Pos)                 /* (GPIO_LAT)  Mask */
#define GPIO_LAT_LAT3(value)                  (GPIO_LAT_LAT3_Msk & (_UINT32_(value) << GPIO_LAT_LAT3_Pos)) /* Assigment of value for LAT3 in the GPIO_LAT register */
#define GPIO_LAT_LAT4_Pos                     _UINT32_(4)                                          /* (GPIO_LAT)  Position */
#define GPIO_LAT_LAT4_Msk                     (_UINT32_(0x1) << GPIO_LAT_LAT4_Pos)                 /* (GPIO_LAT)  Mask */
#define GPIO_LAT_LAT4(value)                  (GPIO_LAT_LAT4_Msk & (_UINT32_(value) << GPIO_LAT_LAT4_Pos)) /* Assigment of value for LAT4 in the GPIO_LAT register */
#define GPIO_LAT_LAT5_Pos                     _UINT32_(5)                                          /* (GPIO_LAT)  Position */
#define GPIO_LAT_LAT5_Msk                     (_UINT32_(0x1) << GPIO_LAT_LAT5_Pos)                 /* (GPIO_LAT)  Mask */
#define GPIO_LAT_LAT5(value)                  (GPIO_LAT_LAT5_Msk & (_UINT32_(value) << GPIO_LAT_LAT5_Pos)) /* Assigment of value for LAT5 in the GPIO_LAT register */
#define GPIO_LAT_LAT6_Pos                     _UINT32_(6)                                          /* (GPIO_LAT)  Position */
#define GPIO_LAT_LAT6_Msk                     (_UINT32_(0x1) << GPIO_LAT_LAT6_Pos)                 /* (GPIO_LAT)  Mask */
#define GPIO_LAT_LAT6(value)                  (GPIO_LAT_LAT6_Msk & (_UINT32_(value) << GPIO_LAT_LAT6_Pos)) /* Assigment of value for LAT6 in the GPIO_LAT register */
#define GPIO_LAT_LAT7_Pos                     _UINT32_(7)                                          /* (GPIO_LAT)  Position */
#define GPIO_LAT_LAT7_Msk                     (_UINT32_(0x1) << GPIO_LAT_LAT7_Pos)                 /* (GPIO_LAT)  Mask */
#define GPIO_LAT_LAT7(value)                  (GPIO_LAT_LAT7_Msk & (_UINT32_(value) << GPIO_LAT_LAT7_Pos)) /* Assigment of value for LAT7 in the GPIO_LAT register */
#define GPIO_LAT_LAT8_Pos                     _UINT32_(8)                                          /* (GPIO_LAT)  Position */
#define GPIO_LAT_LAT8_Msk                     (_UINT32_(0x1) << GPIO_LAT_LAT8_Pos)                 /* (GPIO_LAT)  Mask */
#define GPIO_LAT_LAT8(value)                  (GPIO_LAT_LAT8_Msk & (_UINT32_(value) << GPIO_LAT_LAT8_Pos)) /* Assigment of value for LAT8 in the GPIO_LAT register */
#define GPIO_LAT_LAT9_Pos                     _UINT32_(9)                                          /* (GPIO_LAT)  Position */
#define GPIO_LAT_LAT9_Msk                     (_UINT32_(0x1) << GPIO_LAT_LAT9_Pos)                 /* (GPIO_LAT)  Mask */
#define GPIO_LAT_LAT9(value)                  (GPIO_LAT_LAT9_Msk & (_UINT32_(value) << GPIO_LAT_LAT9_Pos)) /* Assigment of value for LAT9 in the GPIO_LAT register */
#define GPIO_LAT_LAT10_Pos                    _UINT32_(10)                                         /* (GPIO_LAT)  Position */
#define GPIO_LAT_LAT10_Msk                    (_UINT32_(0x1) << GPIO_LAT_LAT10_Pos)                /* (GPIO_LAT)  Mask */
#define GPIO_LAT_LAT10(value)                 (GPIO_LAT_LAT10_Msk & (_UINT32_(value) << GPIO_LAT_LAT10_Pos)) /* Assigment of value for LAT10 in the GPIO_LAT register */
#define GPIO_LAT_LAT11_Pos                    _UINT32_(11)                                         /* (GPIO_LAT)  Position */
#define GPIO_LAT_LAT11_Msk                    (_UINT32_(0x1) << GPIO_LAT_LAT11_Pos)                /* (GPIO_LAT)  Mask */
#define GPIO_LAT_LAT11(value)                 (GPIO_LAT_LAT11_Msk & (_UINT32_(value) << GPIO_LAT_LAT11_Pos)) /* Assigment of value for LAT11 in the GPIO_LAT register */
#define GPIO_LAT_LAT12_Pos                    _UINT32_(12)                                         /* (GPIO_LAT)  Position */
#define GPIO_LAT_LAT12_Msk                    (_UINT32_(0x1) << GPIO_LAT_LAT12_Pos)                /* (GPIO_LAT)  Mask */
#define GPIO_LAT_LAT12(value)                 (GPIO_LAT_LAT12_Msk & (_UINT32_(value) << GPIO_LAT_LAT12_Pos)) /* Assigment of value for LAT12 in the GPIO_LAT register */
#define GPIO_LAT_LAT13_Pos                    _UINT32_(13)                                         /* (GPIO_LAT)  Position */
#define GPIO_LAT_LAT13_Msk                    (_UINT32_(0x1) << GPIO_LAT_LAT13_Pos)                /* (GPIO_LAT)  Mask */
#define GPIO_LAT_LAT13(value)                 (GPIO_LAT_LAT13_Msk & (_UINT32_(value) << GPIO_LAT_LAT13_Pos)) /* Assigment of value for LAT13 in the GPIO_LAT register */
#define GPIO_LAT_LAT14_Pos                    _UINT32_(14)                                         /* (GPIO_LAT)  Position */
#define GPIO_LAT_LAT14_Msk                    (_UINT32_(0x1) << GPIO_LAT_LAT14_Pos)                /* (GPIO_LAT)  Mask */
#define GPIO_LAT_LAT14(value)                 (GPIO_LAT_LAT14_Msk & (_UINT32_(value) << GPIO_LAT_LAT14_Pos)) /* Assigment of value for LAT14 in the GPIO_LAT register */
#define GPIO_LAT_Msk                          _UINT32_(0x00007FFF)                                 /* (GPIO_LAT) Register Mask  */

#define GPIO_LAT_LAT_Pos                      _UINT32_(0)                                          /* (GPIO_LAT Position)  */
#define GPIO_LAT_LAT_Msk                      (_UINT32_(0x7FFF) << GPIO_LAT_LAT_Pos)               /* (GPIO_LAT Mask) LAT */
#define GPIO_LAT_LAT(value)                   (GPIO_LAT_LAT_Msk & (_UINT32_(value) << GPIO_LAT_LAT_Pos)) 

