Microchip-MPLAB-Harmony/wireless_apps_pic32cxbz3_wbz35/apps/zigbee/csc_sleep_touch/firmware/src/packs/WBZ351_DFP/component/gpio.h
#define GPIO_CNPUSET_Msk                      _UINT32_(0x00000000)                                 /* (GPIO_CNPUSET) Register Mask  */


/* -------- GPIO_CNPUINV : (GPIO Offset: 0x5C) (R/W 32)  -------- */
#define GPIO_CNPUINV_RESETVALUE               _UINT32_(0x00)                                       /*  (GPIO_CNPUINV)   Reset Value */

#define GPIO_CNPUINV_Msk                      _UINT32_(0x00000000)                                 /* (GPIO_CNPUINV) Register Mask  */


/* -------- GPIO_CNPD : (GPIO Offset: 0x60) (R/W 32)  -------- */
#define GPIO_CNPD_RESETVALUE                  _UINT32_(0x00)                                       /*  (GPIO_CNPD)   Reset Value */

#define GPIO_CNPD_CNPD0_Pos                   _UINT32_(0)                                          /* (GPIO_CNPD)  Position */
#define GPIO_CNPD_CNPD0_Msk                   (_UINT32_(0x1) << GPIO_CNPD_CNPD0_Pos)               /* (GPIO_CNPD)  Mask */
#define GPIO_CNPD_CNPD0(value)                (GPIO_CNPD_CNPD0_Msk & (_UINT32_(value) << GPIO_CNPD_CNPD0_Pos)) /* Assigment of value for CNPD0 in the GPIO_CNPD register */
#define GPIO_CNPD_CNPD1_Pos                   _UINT32_(1)                                          /* (GPIO_CNPD)  Position */
#define GPIO_CNPD_CNPD1_Msk                   (_UINT32_(0x1) << GPIO_CNPD_CNPD1_Pos)               /* (GPIO_CNPD)  Mask */
#define GPIO_CNPD_CNPD1(value)                (GPIO_CNPD_CNPD1_Msk & (_UINT32_(value) << GPIO_CNPD_CNPD1_Pos)) /* Assigment of value for CNPD1 in the GPIO_CNPD register */
#define GPIO_CNPD_CNPD2_Pos                   _UINT32_(2)                                          /* (GPIO_CNPD)  Position */
#define GPIO_CNPD_CNPD2_Msk                   (_UINT32_(0x1) << GPIO_CNPD_CNPD2_Pos)               /* (GPIO_CNPD)  Mask */
#define GPIO_CNPD_CNPD2(value)                (GPIO_CNPD_CNPD2_Msk & (_UINT32_(value) << GPIO_CNPD_CNPD2_Pos)) /* Assigment of value for CNPD2 in the GPIO_CNPD register */
#define GPIO_CNPD_CNPD3_Pos                   _UINT32_(3)                                          /* (GPIO_CNPD)  Position */
#define GPIO_CNPD_CNPD3_Msk                   (_UINT32_(0x1) << GPIO_CNPD_CNPD3_Pos)               /* (GPIO_CNPD)  Mask */
#define GPIO_CNPD_CNPD3(value)                (GPIO_CNPD_CNPD3_Msk & (_UINT32_(value) << GPIO_CNPD_CNPD3_Pos)) /* Assigment of value for CNPD3 in the GPIO_CNPD register */
#define GPIO_CNPD_CNPD4_Pos                   _UINT32_(4)                                          /* (GPIO_CNPD)  Position */
#define GPIO_CNPD_CNPD4_Msk                   (_UINT32_(0x1) << GPIO_CNPD_CNPD4_Pos)               /* (GPIO_CNPD)  Mask */
#define GPIO_CNPD_CNPD4(value)                (GPIO_CNPD_CNPD4_Msk & (_UINT32_(value) << GPIO_CNPD_CNPD4_Pos)) /* Assigment of value for CNPD4 in the GPIO_CNPD register */
#define GPIO_CNPD_CNPD5_Pos                   _UINT32_(5)                                          /* (GPIO_CNPD)  Position */
#define GPIO_CNPD_CNPD5_Msk                   (_UINT32_(0x1) << GPIO_CNPD_CNPD5_Pos)               /* (GPIO_CNPD)  Mask */
#define GPIO_CNPD_CNPD5(value)                (GPIO_CNPD_CNPD5_Msk & (_UINT32_(value) << GPIO_CNPD_CNPD5_Pos)) /* Assigment of value for CNPD5 in the GPIO_CNPD register */
#define GPIO_CNPD_CNPD6_Pos                   _UINT32_(6)                                          /* (GPIO_CNPD)  Position */
#define GPIO_CNPD_CNPD6_Msk                   (_UINT32_(0x1) << GPIO_CNPD_CNPD6_Pos)               /* (GPIO_CNPD)  Mask */
#define GPIO_CNPD_CNPD6(value)                (GPIO_CNPD_CNPD6_Msk & (_UINT32_(value) << GPIO_CNPD_CNPD6_Pos)) /* Assigment of value for CNPD6 in the GPIO_CNPD register */
#define GPIO_CNPD_CNPD7_Pos                   _UINT32_(7)                                          /* (GPIO_CNPD)  Position */
#define GPIO_CNPD_CNPD7_Msk                   (_UINT32_(0x1) << GPIO_CNPD_CNPD7_Pos)               /* (GPIO_CNPD)  Mask */
#define GPIO_CNPD_CNPD7(value)                (GPIO_CNPD_CNPD7_Msk & (_UINT32_(value) << GPIO_CNPD_CNPD7_Pos)) /* Assigment of value for CNPD7 in the GPIO_CNPD register */
#define GPIO_CNPD_CNPD8_Pos                   _UINT32_(8)                                          /* (GPIO_CNPD)  Position */
#define GPIO_CNPD_CNPD8_Msk                   (_UINT32_(0x1) << GPIO_CNPD_CNPD8_Pos)               /* (GPIO_CNPD)  Mask */
#define GPIO_CNPD_CNPD8(value)                (GPIO_CNPD_CNPD8_Msk & (_UINT32_(value) << GPIO_CNPD_CNPD8_Pos)) /* Assigment of value for CNPD8 in the GPIO_CNPD register */
#define GPIO_CNPD_CNPD9_Pos                   _UINT32_(9)                                          /* (GPIO_CNPD)  Position */
#define GPIO_CNPD_CNPD9_Msk                   (_UINT32_(0x1) << GPIO_CNPD_CNPD9_Pos)               /* (GPIO_CNPD)  Mask */
#define GPIO_CNPD_CNPD9(value)                (GPIO_CNPD_CNPD9_Msk & (_UINT32_(value) << GPIO_CNPD_CNPD9_Pos)) /* Assigment of value for CNPD9 in the GPIO_CNPD register */
#define GPIO_CNPD_CNPD10_Pos                  _UINT32_(10)                                         /* (GPIO_CNPD)  Position */
#define GPIO_CNPD_CNPD10_Msk                  (_UINT32_(0x1) << GPIO_CNPD_CNPD10_Pos)              /* (GPIO_CNPD)  Mask */
#define GPIO_CNPD_CNPD10(value)               (GPIO_CNPD_CNPD10_Msk & (_UINT32_(value) << GPIO_CNPD_CNPD10_Pos)) /* Assigment of value for CNPD10 in the GPIO_CNPD register */
#define GPIO_CNPD_CNPD11_Pos                  _UINT32_(11)                                         /* (GPIO_CNPD)  Position */
#define GPIO_CNPD_CNPD11_Msk                  (_UINT32_(0x1) << GPIO_CNPD_CNPD11_Pos)              /* (GPIO_CNPD)  Mask */
#define GPIO_CNPD_CNPD11(value)               (GPIO_CNPD_CNPD11_Msk & (_UINT32_(value) << GPIO_CNPD_CNPD11_Pos)) /* Assigment of value for CNPD11 in the GPIO_CNPD register */
#define GPIO_CNPD_CNPD12_Pos                  _UINT32_(12)                                         /* (GPIO_CNPD)  Position */
#define GPIO_CNPD_CNPD12_Msk                  (_UINT32_(0x1) << GPIO_CNPD_CNPD12_Pos)              /* (GPIO_CNPD)  Mask */
#define GPIO_CNPD_CNPD12(value)               (GPIO_CNPD_CNPD12_Msk & (_UINT32_(value) << GPIO_CNPD_CNPD12_Pos)) /* Assigment of value for CNPD12 in the GPIO_CNPD register */
#define GPIO_CNPD_CNPD13_Pos                  _UINT32_(13)                                         /* (GPIO_CNPD)  Position */
#define GPIO_CNPD_CNPD13_Msk                  (_UINT32_(0x1) << GPIO_CNPD_CNPD13_Pos)              /* (GPIO_CNPD)  Mask */
#define GPIO_CNPD_CNPD13(value)               (GPIO_CNPD_CNPD13_Msk & (_UINT32_(value) << GPIO_CNPD_CNPD13_Pos)) /* Assigment of value for CNPD13 in the GPIO_CNPD register */
#define GPIO_CNPD_CNPD14_Pos                  _UINT32_(14)                                         /* (GPIO_CNPD)  Position */
#define GPIO_CNPD_CNPD14_Msk                  (_UINT32_(0x1) << GPIO_CNPD_CNPD14_Pos)              /* (GPIO_CNPD)  Mask */
#define GPIO_CNPD_CNPD14(value)               (GPIO_CNPD_CNPD14_Msk & (_UINT32_(value) << GPIO_CNPD_CNPD14_Pos)) /* Assigment of value for CNPD14 in the GPIO_CNPD register */
#define GPIO_CNPD_Msk                         _UINT32_(0x00007FFF)                                 /* (GPIO_CNPD) Register Mask  */

